/**
 * Created with JetBrains PhpStorm.
 * User: xuheng
 * Date: 12-9-26
 * Time: 下午1:09
 * To change this template use File | Settings | File Templates.
 */
 
var charsContent = [
    {
        name: "tsfh",
        title: lang.tsfh,
        content: toArray("△, ▲, ▽, ▼, ○, ●, ◇, ◆, □, ■, ☆, ★, ▷, ▶, ◁, ◀, ♤, ♠, ♡, ♥, ♢, ♦, ♧, ♣, ☼, ☀, ☽, ☾, ♀, ♂, ☺, ☹, ◐, ◑, ☑, ☒, √, ×, ✔, ✘, ☜, ☚, ☟, ☞, ☛, ✊, ✋, ✌, 👊, 👍, ☝, 👆, 👇, 👈, 👉, 👋, 👏, 👌, ✍, 👎, 👐, ㏂, ㏘, ▪, •, ‥, …, ▁, ▂, ▃, ▄, ▅, ▆, ▇, █, ∷, ※, ░, ▒, ▓, ▏, ▎, ▍, ▌, ▋, ▊, ▉, ♩, ♪, ♫, ♬, §, 〼, ◎, ¤, ۞, ℗, ®, ©, ♭, ♯, ♮, ‖, ¶, 卍, 卐, ▬, 〓, ℡, ™, ㏇☌, ☍, ☋, ☊, ㉿, ◮, ◪, ◔, ◕, @, ㈱, №, ♈, ♉, ♊, ♋, ♌, ♎, ♏, ♐, ♑, ♓, ♒, ♍, ↖, ↑, ↗, ←, →, ↙, ↓, ↘, ㊣, ㊥, ㊤, ㊦, ㊧, ㊨, ◤, ◥, ◣, ◢, ☴, ☲, ☷, ☳, ☱, ☶, ☵, ☰, ☯, ▨, ▧, ▤, ▥, ▩, ▦, ▫, ◈, ▣, ↕, ↔, ⊱, ⋛, ⋌, ⋚, ⊰, ¬, ￢, ▔, †, ‡, *, ＊, ✲, ✴, ❈, ❉, ✿, ❀, ❃, ❁, ☸, ✖, ✚, 〰, ✪, ❤, ღ, ❦, ❧, , , , ி, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ₪, ✎, ✁, ✄, ☁, ☂, ☃, ☄, ♨, ☇, ☈, ☡, ➷, ⊹, ✉, ☏, ☢, ☣, ☠, ☭, ❂, ☪, ☮, 〄, ➹, ☩, ஐ, ☎, ✈, 〠, ۩, ✙, ✟, ☤, ☥, ☦, ☧, ☨, ❄, ☫, ☬, ♟, ♙, ♜, ♖, ♞, ♘, ♝, ♗, ♛, ♕, ♚, ♔, ☔, ⛄, ⚡, 🌀, 🌁, 🌂, 🌃, 🌄, 🌅, 🌆, 🌇, 🌈, ⛅, 🌉, 🌊, 🌋, 🌌, 🌏, 🌑, 🌔, 🌓, 🌙, 🌕, 🌛, 🌟, 🌠, 🕐, 🕑, 🕒, 🕓, 🕔, 🕕, 🕖, 🕗, 🕘, 🕙, 🕚, 🕛, ⌚, ⌛, ⏰, ⏳, 🍀, 🌷, 🌱, 🍁, 🌸, 🌹, 🍂, 🍃, 🌺, 🌻, 🌴, 🌵, 🌾, 🌽, 🍄, 🌰, 🌼, 🌿, 🍒, 🍌, 🍎, 🍊, 🍓, 🍉, 🍅, 🍆, 🍈, 🍍, 🍇, 🍑, 🍏, 👀, 👂, 👃, 👄, 👅, 💄, 💅, 💆, 💇, 💈, 👤, 👦, 👧, 👨, 👩, 👪, 👫, 👮, 👯, 👰, 👱, 👲, 👳, 👴, 👵, 👶, 👷, 👸, 👹, 👺, 👻, 👼, 👽, 👾, 👿, 💀, 💁, 💂, 💃, 🐌, 🐍, 🐎, 🐔, 🐗, 🐫, 🐘, 🐨, 🐒, 🐑, 🐙, 🐚, 🐛, 🐜, 🐝, 🐞, 🐠, 🐡, 🐢, 🐤, 🐥, 🐦, 🐣, 🐧, 🐩, 🐟, 🐬, 🐭, 🐯, 🐱, 🐳, 🐴, 🐵, 🐶, 🐷, 🐻, 🐹, 🐺, 🐮, 🐰, 🐸, 🐾, 🐲, 🐼, 🐽, 😠, 😩, 😲, 😞, 😵, 😰, 😒, 😍, 😤, 😜, 😝, 😋, 😘, 😚, 😷, 😳, 😃, 😅, 😆, 😁, 😂, 😊, 😄, 😢, 😭, 😨, 😣, 😡, 😌, 😖, 😔, 😱, 😪, 😏, 😓, 😥, 😫, 😉, 😺, 😸, 😹, 😽, 😻, 😿, 😾, 😼, 🙀, 🙅, 🙆, 🙇, 🙈, 🙊, 🙉, 🙋, 🙌, 🙍, 🙎, 🙏, 🏠, 🏡, 🏢, 🏣, 🏥, 🏦, 🏧, 🏨, 🏩, 🏪, 🏫, ⛪, ⛲, 🏬, 🏯, 🏰, 🏭, ⚓, 🏮, 🗻, 🗼, 🗽, 🗾, 🗿, 👞, 👟, 👠, 👡, 👢, 👣, 👓, 👕, 👖, 👑, 👔, 👒, 👗, 👘, 👙, 👚, 👛, 👜, 👝, 💰, 💱, 💹, 💲, 💳, 💴, 💵, 💸, 🔥, 🔦, 🔧, 🔨, 🔩, 🔪, 🔫, 🔮, 🔯, 🔰, 🔱, 💉, 💊, 🅰, 🅱, 🆎, 🅾, 🎀, 🎁, 🎂, 🎄, 🎅, 🎌, 🎆, 🎈, 🎉, 🎍, 🎎, 🎓, 🎒, 🎏, 🎇, 🎐, 🎃, 🎊, 🎋, 🎑, 📟, ☎, 📞, 📱, 📲, 📝, 📠, ✉, 📨, 📩, 📪, 📫, 📮, 📰, 📢, 📣, 📡, 📤, 📥, 📦, 📧, 🔠, 🔡, 🔢, 🔣, 🔤, ✒, 💺, 💻, ✏, 📎, 💼, 💽, 💾, 💿, 📀, ✂, 📍, 📃, 📄, 📅, 📁, 📂, 📓, 📖, 📔, 📕, 📗, 📘, 📙, 📚, 📛, 📜, 📋, 📆, 📊, 📈, 📉, 📇, 📌, 📒, 📏, 📐, 📑, 🎽, ⚾, ⛳, 🎾, ⚽, 🎿, 🏀, 🏁, 🏂, 🏃, 🏄, 🏆, 🏈, 🏊, 🚃, 🚇, Ⓜ, 🚄, 🚅, 🚗, 🚙, 🚌, 🚏, 🚢, ✈, ⛵, 🚉, 🚀, 🚤, 🚕, 🚚, 🚒, 🚑, 🚓, ⛽, 🅿, 🚥, 🚧, 🚨, ♨, ⛺, 🎠, 🎡, 🎢, 🎣, 🎤, 🎥, 🎦, 🎧, 🎨, 🎩, 🎪, 🎫, 🎬, 🎭, 🎮, 🀄, 🎯, 🎰, 🎱, 🎲, 🎳, 🎴, 🃏, 🎵, 🎶, 🎷, 🎸, 🎹, 🎺, 🎻, 🎼, 〽, 📷, 📹, 📺, 📻, 📼, 💋, 💌, 💍, 💎, 💏, 💐, 💑, 💒, 🔞, 🔟, 📶, 📳, 📴, 🍔, 🍙, 🍰, 🍜, 🍞, 🍳, 🍦, 🍟, 🍡, 🍘, 🍚, 🍝, 🍛, 🍢, 🍣, 🍱, 🍲, 🍧, 🍖, 🍥, 🍠, 🍕, 🍗, 🍨, 🍩, 🍪, 🍫, 🍬, 🍭, 🍮, 🍯, 🍤, 🍴, ☕, 🍸, 🍺, 🍵, 🍶, 🍷, 🍻, 🍹, ⏩, ⏪, ⏫, ⏬, 🔺, 🔻, 🔼, 🔽, ⭕, ❌, ❎, ❗, ❓, ❔, ❕, ➰, ➿, ❤, 💓, 💔, 💕, 💖, 💗, 💘, 💙, 💚, 💛, 💜, 💝, 💞, 💟, 🚬, 🚭, ♿, 🚩, ⛔, 🚲, 🚶, 🚹, 🚺, 🛀, 🚻, 🚽, 🚾, 🚼, 🚪, 🚫, 🆑, 🆒, 🆓, 🆔, 🆕, 🆖, 🆗, 🆘, 🆙, 🆚, 🈁, 🈂, 🈲, 🈳, 🈴, 🈵, 🈶, 🈚, 🈷, 🈸, 🈹, 🈯, 🈺, ㊙, ㊗, 🉐, 🉑, ➕, ➖, ✖, ➗, 💠, 💡, 💢, 💣, 💤, 💥, 💦, 💧, 💨, 💩, 💪, 💫, 💬, ✨, ⚪, ⚫, 🔴, 🔵, 🔲, 🔳, ⭐, ⬜, ⬛, 🔶, 🔷, 🔸, 🔹, 💮, 💯, 🔃, 🔊, 🔋, 🔌, 🔍, 🔎, 🔒, 🔓, 🔏, 🔐, 🔑, 🔔, 🔘, 🔖, 🔗, 🔙, 🔚, 🔛, 🔜, 🔝")
    },
    {
        name: "bdfh",
        title: lang.bdfh,
        content: toArray("，,。,.,？,?,！,!,：,:,；,;,·,、,…,……,~,～,&,＆,@,＠,#,＃,“,”,‘,’,〝,〞,',＂,＇,´,＇,(,),【,】,《,》,＜,＞,﹝,﹞,<,>,(,),[,],«,»,‹,›,〔,〕,〈,〉,{,},［,］,「,」,｛,｝,〖,〗,『,』,︵,︶,︷,︸,︹,︺,︿,﹀,︽,︾,﹁,﹂,﹃,﹄,︻,︼,︗,︘,/,／,|,｜,＼,_,¯,＿,￣,﹏,﹋,﹍,﹉,﹎,﹊,`,ˋ,¦,︴,¡,¿,^,ˇ")
    },
    {
        name: "sxdw",
        title: lang.sxdw,
        content: toArray("﹢,＋,﹢,﹣,－,﹣,±,×,÷,/,=,＝,≈,≒,≡,≠,﹤,＜,﹥,＞,≦,≤,≧,≥,≮,≯,·,∶,∵,∴,∷,㏒,㏑,∑,∏,∅,∝,∞,∽,≌,∈,∉,∩,∪,∧,∨,⊙,⊕,⌒,⊿,∥,∟,∣,∂,∆,⊥,∠,∫,∬,∭,%,‰,％,º,¹,²,³,ⁿ,℅,∮,∯,∰,₁,₂,₃,½,⅓,⅔,¼,¾,°,℃,℉,〒,㎎,㎏,μm,㎜,㎝,㎞,′,¥,$,€,฿,￡,㎡,m³,㏄,ml,mol,㏕,″,￥,£,￠,₠")
    },
    {
        name: "szfh",
        title: lang.szfh,
        content: toArray("⒈,⒉,⒊,⒋,⒌,⒍,⒎,⒏,⒐,⒑,⒒,⒓,⒔,⒕,⒖,⒗,⒘,⒙,⒚,⒛,⑴,⑵,⑶,⑷,⑸,⑹,⑺,⑻,⑼,⑽,⑾,⑿,⒀,⒁,⒂,⒃,⒄,⒅,⒆,⒇,ⅰ,ⅱ,ⅲ,ⅳ,ⅴ,ⅵ,ⅶ,ⅷ,ⅸ,ⅹ,Ⅰ,Ⅱ,Ⅲ,Ⅳ,Ⅴ,Ⅵ,Ⅶ,Ⅷ,Ⅸ,Ⅹ,Ⅺ,Ⅻ,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,❶,❷,❸,❹,❺,❻,❼,❽,❾,❿,㈠,㈡,㈢,㈣,㈤,㈥,㈦,㈧,㈨,㈩")
    },
    {
        name: "pyzm",
        title: lang.pyzm,
        content: toArray("ā,á,ǎ,à,ē,é,ě,è,ī,í,ǐ,ì,ō,ó,ǒ,ò,ū,ú,ǔ,ù,ǖ,ǘ,ǚ,ǜ,ü,ń,ň,,ê,,ㄚ,ㄛ,ㄜ,ㄧ,ㄨ,ㄩ,ㄝ,ㄞ,ㄟ,ㄠ,ㄡ,ㄢ,ㄣ,ㄤ,ㄥ,ㄦ,ㄅ,ㄆ,ㄇ,ㄈ,ㄉ,ㄊ,ㄋ,ㄌ,ㄍ,ㄎ,ㄏ,ㄐ,ㄑ,ㄒ,ㄓ,ㄔ,ㄕ,ㄖ,ㄗ,ㄘ,ㄙ")
    },
    {
        name: "yyyb",
        title: lang.yyyb,
        content: toArray("i:,i,e,æ,ʌ,ə:,ə,u:,u,ɔ:,ɔ,a:,ei,ai,ɔi,əu,au,iə,εə,uə,p,t,k,b,d,g,f,s,ʃ,θ,h,v,z,ʒ,ð,tʃ,tr,ts,dʒ,dr,dz,m,n,ŋ,l,r,w,j,")
    },
    {
        name: "zbfh",
        title: lang.zbfh,
        content: toArray("┌,┬,┐,┏,┳,┓,╔,╦,╗,╭,─,╮,┍,┑,┎,┒,├,┼,┤,┣,╋,┫,╠,╬,╣,│,╳,┃,┕,┙,┖,┚,└,┴,┘,┗,┻,┛,╚,╩,╝,╰,━,╯,┄,┅,┆,┇,╒,╕,╓,╖,╱,╲,┝,┞,┟,┠,┡,┢,═,╞,╟,╡,╘,╛,╙,╜,╲,╱,╢,╪,┭,┮,┯,┰,┱,┲,║,╤,╥,╧,╨,╫,┥,┦,┧,┨,┩,┪,┽,┾,┿,╀,╁,╂,┵,┶,┷,┸,┹,┺,╄,╅,╆,╇,╈,╉,┈,┉,┊,┋,╃,╊")
    },
    {
        name: "xlzm",
        title: lang.xlzm,
        content: toArray("Α,Β,Γ,Δ,Ε,Ζ,Η,Θ,Ι,Κ,Λ,Μ,Ν,Ξ,Ο,Π,Ρ,Σ,Τ,Υ,Φ,Χ,Ψ,Ω,α,β,γ,δ,ε,ζ,η,θ,ι,κ,λ,μ,ν,ξ,ο,π,ρ,σ,τ,υ,φ,χ,ψ,ω,À,Á,Â,Ã,Ä,Å,Æ,Ç,È,É,Ê,Ë,Ì,Í,Î,Ï,Ð,Ñ,Ò,Ó,Ô,Õ,Ö,Ø,Ù,Ú,Û,Ü,Ý,Þ,Š,Ÿ,Œ")
    },
    {
        name: "rwfh",
        title: lang.rwfh,
        content: toArray("ぁ,あ,ぃ,い,ぅ,う,ぇ,え,ぉ,お,か,が,き,ぎ,く,ぐ,け,げ,こ,ご,さ,ざ,し,じ,す,ず,せ,ぜ,そ,ぞ,た,だ,ち,ぢ,っ,つ,づ,て,で,と,ど,な,に,ぬ,ね,の,は,ば,ぱ,ひ,び,ぴ,ふ,ぶ,ぷ,へ,べ,ぺ,ほ,ぼ,ぽ,ま,み,む,め,も,ゃ,や,ゅ,ゆ,ょ,よ,ら,り,る,れ,ろ,ゎ,わ,ゐ,ゑ,を,ん,ァ,ア,ィ,イ,ゥ,ウ,ェ,エ,ォ,オ,カ,ガ,キ,ギ,ク,グ,ケ,ゲ,コ,ゴ,サ,ザ,シ,ジ,ス,ズ,セ,ゼ,ソ,ゾ,タ,ダ,チ,ヂ,ッ,ツ,ヅ,テ,デ,ト,ド,ナ,ニ,ヌ,ネ,ノ,ハ,バ,パ,ヒ,ビ,ピ,フ,ブ,プ,ヘ,ベ,ペ,ホ,ボ,ポ,マ,ミ,ム,メ,モ,ャ,ヤ,ュ,ユ,ョ,ヨ,ラ,リ,ル,レ,ロ,ヮ,ワ,ヰ,ヱ,ヲ,ン,ヴ,ヵ,ヶ")
    },
    {
        name: "hwfh",
        title: lang.hwfh,
        content: toArray("ㅏ,ㅑ,ㅓ,ㅕ,ㅗ,ㅛ,ㅜ,ㅠ,ㅡ,ㅣ,ㅐ,ㅒ,ㅔ,ㅖ,ㅘ,ㅙ,ㅚ,ㅝ,ㅞ,ㅟ,ㅢ,ㄱ,ㄴ,ㄷ,ㄹ,ㅁ,ㅂ,ㅅ,ㅇ,ㅈ,ㅊ,ㅋ,ㅌ,ㅍ,ㅎ,ㄲ,ㄸ,ㅃ,ㅆ,ㅉ,㉠,㉡,㉢,㉣,㉤,㉥,㉦,㉧,㉨,㉩,㉪,㉫,㉬,㉭,㉮,㉯,㉰,㉱,㉲,㉳,㉴,㉵,㉶,㉷,㉸,㉹,㉺,㉻,㈀,㈁,㈂,㈃,㈄,㈅,㈆,㈇,㈈,㈉,㈊,㈋,㈌,㈍,㈎,㈏,㈐,㈑,㈒,㈓,㈔,㈕,㈖,㈗,㈘,㈙,㈚,㈛")
    },
    {
        name: "ewzm",
        title: lang.ewzm,
        content: toArray("А,Б,В,Г,Д,Е,Ё,Ж,З,И,Й,К,Л,М,Н,О,П,Р,С,Т,У,Ф,Х,Ц,Ч,Ш,Щ,Ъ,Ы,Ь,Э,Ю,Я,а,б,в,г,д,е,ё,ж,з,и,й,к,л,м,н,о,п,р,с,т,у,ф,х,ц,ч,ш,щ,ъ,ы,ь,э,ю,я")
    },
    {
        name: "zyzf",
        title: lang.zyzf,
        content: toArray("一,丨,丿,丶,㇏,亅,乚,乛,㇀,乀,ㄋ,〇,𠃊,𠃎,𠃍,匚,凵,冂,丅,丄,𠄌,𠃋,𡿨,𠃌,卍,曱,〡,〢,〣,〤,〥,〦,〧,〨,〩,十,卐,甴,弍,弎,弐,卄,巜,〆,〃,々,の,囧,丶,冫,氵,灬,阝,卩,刂,忄,讠,扌,亻,彳,厃,⺁,𠘨,⺆,⺄,广,疒,饣,钅,礻,衤,辶,牜,釒,飠,⺪,⻊,糹,⺝,丩,丬,犭,纟,廴,攵,夊,皿,臼,虍,勹,尢,廾,歺,夬,氺,丂,爫,癶,耂,⺻,⺮,⺳,⺶,⺷,⺈,龵,彐,⺋,罒,覀,⻗,亠,宀,冖,艹,⺌,丷,⺧,亇,彡,零,壹,贰,叁,肆,伍,陆,柒,捌,玖,拾,佰,仟,万,亿,兆,吉,太,拍,艾,分,厘,毫,微,玊,嘂,槑,朤,囍,嬲,嫐,靐,龘,鑫,淼,焱,嘦,巭,勥,氼,嫑,炛,恏,兲,奣,烎,忈,龑,")
    }
];
(function createTab(content) {
    for (var i = 0, ci; ci = content[i++];) {
        var span = document.createElement("span");
        span.setAttribute("tabSrc", ci.name);
        span.innerHTML = ci.title;
        if (i == 1)span.className = "focus";
        domUtils.on(span, "click", function () {
            var tmps = $G("tabHeads").children;
            for (var k = 0, sk; sk = tmps[k++];) {
                sk.className = "";
            }
            tmps = $G("tabBodys").children;
            for (var k = 0, sk; sk = tmps[k++];) {
                sk.style.display = "none";
            }
            this.className = "focus";
            $G(this.getAttribute("tabSrc")).style.display = "";
        });
        $G("tabHeads").appendChild(span);
        domUtils.insertAfter(span, document.createTextNode("\n"));
        var div = document.createElement("div");
        div.id = ci.name;
        div.style.display = (i == 1) ? "" : "none";
        var cons = ci.content;
        for (var j = 0, con; con = cons[j++];) {
            var charSpan = document.createElement("span");
            charSpan.innerHTML = con;
            domUtils.on(charSpan, "click", function () {
                editor.execCommand("insertHTML", this.innerHTML);
                dialog.close();
            });
            div.appendChild(charSpan);
        }
        $G("tabBodys").appendChild(div);
    }
})(charsContent);
function toArray(str) {
    return str.split(",");
}
